ID:US-1
Feature: Возможность проиложения роботать кроссплатформенно 
    Как один из членов семьи(Муж,Жена,Дети)
    I хочу иметь возможность запускать приложени(е/я)
    на таких операционных системах :
    (MacOS ver.{Sierra-Mojave},Windows ver.{Windows XP - Windows 10(fall creators update)},Linux ver.{Ubuntu})
    Для того чтобы не зависеть от одного устройства 

    Scenario: Открыть приложение на настольном компьютере
        Given компьютер с установленной одной из упомянутых операционных систем:(Windows,Linux,MacOS)
        When приложение открылось
        Then приложение работает без аварийных завершений
        And елементы управления(Кнопки,Меню,Поля ввода) отображаються в соответствии с 
            версией дизайна под определенную операционную систему

    Scenario: Скачать приложение 
        Given компьютер с установленой одной из упомянутых операционных систем и их версий:(Windows,Linux,MacOS)
        When найден официальный(www.softLogic.familyDB.com) ресурс для загрузки   
        Then пользователь должен иметь возможность скачать 
             приложение под одну из упомянутых операционных систем и их версий(Windows,Linux,MacOS)

ID:US-2 
Feature: Возможность сохранять информацию о всех членах семьи в 1 файле |базы данных:see Glossary|
    в виде {Название члена семьи, Имя, Отчество, Фамилия,Дата рожд.}      
    ----------------------------------------------------------------
    Как один из членов семьи(Муж,Жена,Дети)
    I хочу после внесения изменений или создания пустого файла базы данных
      сохранить его в одном файле с разширением |{.mdf}:see Glossary|.
      Чтобы открыть его в будущем для внесения изменений или извлечения(копирования) информации   


    Scenario: Сохранить файл базы данных семьи с заполненой информацией
        в виде {Название члена семьи, Имя, Отчество, Фамилия,Дата рожд.}  
        ----------------------------------------------------------------
        Given файл с заполненой информацией 
        When  пользователь нажимает кнопку Save Database(Button-3)
        Then  в едином файле базы данных с разширением:|{.mdf}:see Glossary|.
              сохраняются все(в контексте одной |пользовательской сессии:see Glossary|)
              внесенные изменения вместе с ранее добавленной информацией  

    Scenario: Сохранить пустой файл базы данных
        Given файл |базы данных:see Glossary| с пустыми |ячейками таблицы:see Glossary|         
        When пользователь нажимает кнопку Save Database(Button-3)
        Then файл успешно(без ошибок со стороны исходной программы или базы данных) сохраняется

ID:US-3
Feature: Открытие нескольких[1-N:see Glossay] экземпляров приложений 
         в |панели многозадачности:see Glossary| операционной системы 
    Как один из членов семьи(Муж,Жена,Дети)     
    I хочу создавать необходимое количество экземпляров приложений 
    чтобы работать с несколькими файлами баз данных

    Scenario: Откритие второго либо |N-го:see Glossary| экземпляра приложения  
        Given иконка запуска приложения на рабочем столе
        When один из членов семьи нажимает правой кнопкой мыши 
        Then 
    
    



    


    
              





 
      


    
    
            
        
    
    


      

    