@R-1
Feature: Возможность проиложения роботать кроссплатформенно 
    Как один из членов семьи(Муж,Жена,Дети)
    I хочу иметь возможность запускать приложени(е/я)
    на таких операционных системах :
    (MacOS ver.{Sierra-Mojave},Windows ver.{Windows XP - Windows 10(fall creators update)},Linux ver.{Ubuntu})
    Для того чтобы не зависеть от одного устройства 

    Scenario: Открыть приложение на настольном компьютере
        Given компьютер с установленной одной из упомянутых операционных систем:(Windows,Linux,MacOS)
        When приложение открылось
        Then приложение работает без аварийных завершений
        And елементы управления(Кнопки,Меню,Поля ввода) отображаються в соответствии с 
            версией дизайна под определенную операционную систему

    Scenario: Скачать приложение 
        Given компьютер с установленой одной из упомянутых операционных систем и их версий:(Windows,Linux,MacOS)
        When найден официальный(www.softLogic.familyDB.com) ресурс для загрузки   
        Then пользователь должен иметь возможность скачать 
             приложение под одну из упомянутых операционных систем и их версий(Windows,Linux,MacOS)

@R-2 
Feature: Возможность сохранять информацию о всех членах семьи в 1 файле |базы данных:see Glossary|
    в виде {Название члена семьи, Имя, Отчество, Фамилия,Дата рожд.}      
    ----------------------------------------------------------------
    Как один из членов семьи(Муж,Жена,Дети)
    I хочу после внесения изменений или создания пустого файла базы данных
      сохранить его в одном файле с разширением |{.mdf}:see Glossary|.
      Чтобы открыть его в будущем для внесения изменений или извлечения(копирования) информации   


    Scenario: Сохранить файл базы данных семьи с заполненой информацией
        в виде {Название члена семьи, Имя, Отчество, Фамилия,Дата рожд.}  
        ----------------------------------------------------------------
        Given файл с заполненой информацией 
        When  пользователь нажимает кнопку Save Database(Button-3)
        Then  в едином файле базы данных с разширением:|{.mdf}:see Glossary|.
              сохраняются все(в контексте одной |пользовательской сессии:see Glossary|)
              внесенные изменения вместе с ранее добавленной информацией  

    Scenario: Сохранить пустой файл базы данных
        Given файл |базы данных:see Glossary| с пустыми |ячейками таблицы:see Glossary|         
        When пользователь нажимает кнопку Save Database(Button-3)
        Then файл успешно(без ошибок со стороны исходной программы или базы данных) сохраняется

@R-3
Feature: Открытие нескольких[1-N:see Glossay] экземпляров приложений 
         в |панели многозадачности:see Glossary| операционной системы 
    Как один из членов семьи(Муж,Жена,Дети)     
    I хочу создавать необходимое количество экземпляров приложений 
    чтобы работать с несколькими файлами баз данных

@R-11
Feature: Возможность сохранять и изменять информацию( имя, фамилия, отчество, дата рождения) закладки "Wife"
Как муж 
Я хочу иметь возможность изменять и сохранять информацию ( имя, фамилия, отчество, дата рождения) о своей жене.  
Scenario: Муж допустил грамматическую ошибку в фамилии жены при редактировании ее информации
Given: Неправильно введенные данные о жене 
When: При редактировании профиля жены
Then: Редактирование данных профиля жены на правильные (без грамматических ошибок) и  сохранение измененных данных.


@R-12
Feature: Просмотр родителями информацию об их ребенке(детях)
Как Отец или Мать ребенка(детей)
Я хочу иметь возможность вводить данные о своем(их) ребенке(детях) в базу данных семьи
По этому я хочу добавлять данные о своих детях.
Scenario: Отец или мать зарегистрировали семейную базу данных
Given: База данных с пустыми полями раздела «Ребенок»
When: родители зарегистрировали новую семейную базу данных
Then: родители вводят данные(имя, рост, дата рождения) своего ребенка(детей) в таблицу 

Scenario: В семье появился ребенок
Given: База данных с пустыми или заполненными полями раздела «Ребенок»
When: появился новый ребенок
Then: родители вводят данные(имя, рост, дата рождения) своего нового ребенка(детей) в таблицу


@R-13
Feature: Ввод данных("Name","Height","Birth day") о ребенке в таблицу закладки "Children"
Как Отец или Мать ребенка(детей)
Я хочу иметь возможность вводить данные о своем(их) ребенке(детях) в базу данных семьи
По этому я хочу добавлять данные о своих детях.
Scenario: Отец или мать зарегистрировали семейную базу данных
Given: База данных с пустыми полями раздела "Children"
When: родители зарегистрировали новую семейную базу данных
Then: родители вводят данные("Name","Height","Birth day") своего ребенка(детей) в таблицу 


@R-13.1
Feature: Выделение ячейки в таблице "Children" СБД
    Как один из старших членов семьи(Мать или Отец)
    Я хочу чтобы информация("Name","Height","Birth day") 
    в ячейках таблицы \закладки\ "Children" закрыта для редактирования(измение полей: "Name","Height","Birth day")
    По этому я хочу , чтобы одну или несколько ячеек можно было \выделять\ (чтобы иметь возможность удалить их сразу
    в нескольких экземплярах)
    Scenario: мать или отец ребенка заполняют ячейки таблицы закладки "Children"
    Given : заполненные ячейки("Name","Height","Birth day") таблицы закладки "Children"
    When : мать или отец ребенка имеют намерение отредактировать ячейку таблицы закладки "Children"
    Then : редактирование ячейки не происходит(содержание ячейки остается прежним)


@R-14
Feature: Добавление более одного ребенка в таблицу закладки "Children" СБД
    Как один из старших членов семьи(Мать или Отец)
    Я хочу иметь возможность добавить более одного ребенка 
    в таблицу закладки "Children" СБД

    Scenario: мать или отец ребенка заполняют ячейки таблицы "Children"
    Given :заполненные ячейки("Name","Height","Birth day") таблицы закладки "Children"
    в в таблицу закладки "Children" СБД
    When : родители добавляют несколько детей в семейную базу данных
    Then : таблица пополняется новым полем с пустыми полями: "Name","Height","Birth day"


@R-15
Feature: \Прокручивание\  таблицы в закладке "Children"  при увеличении размера таблицы до размера больше чем размер окна приложения.
    Как пользователь
    Я хочу иметь возможность использовать прокручивание в случае увеличения данных таблицы закладки "Children" до размеров
    больше чем размер \окна\ программы

    Scenario: Строки таблицы закладки "Children" СБД занимают больше визуального места чем размер окна программы
    Given : таблица в закладке "Children"
    When : размер таблицы становится больше, чем размер окна программы
    Then : С правой стороны таблицы появляется ползунок для прокручивания


@R-16
Feature: Наличие кнопок "Add Child", "Del Child" со всплывающими подсказками в закладке "Children"
    Как пользователь
    Я хочу иметь возможность редактировать(добавлять и удалять) строки таблицы закладки "Children" СБД
    Scenario: Пользователь хочет добавить в таблицу новую запись(строку)
    Given : таблица без записей или таблица с записями(заполнеными полями :Имя, рост, Дата рождения )
    When : кнопка "Add Child" нажата
    Then : добавляется новая строка с пустыми полями: Имя, рост, Дата рождения

    Scenario: Пользователь хочет удалить существующую строку в таблице 
    Given : таблица с записями(заполнеными полями :Имя, рост, Дата рождения) 
    When : кнопка "Add Child" нажата
    Then : добавляется новая строка с пустыми полями: Имя, рост, Дата рождения

@R-16.1
Feature: Блокирование кнопки "Del Child" в случае отсуствия записей в таблице закладки "Children" СБД
    Как пользователь
    Я хочу чтобы кнопка "Del Child" была  недоступной/неактивной/не производила свой прямой функционал (удаления записи)
    если записей в таблице нет

    Scenario: Пользователь удаляет строки(запись ребенка) с таблицы
    Given : Заполненная таблица(с одним или несколькими добаволенными детьми)
    When : пользователь выделил строку в таблице и  нажал кнопку "Del Child"
    Then :  выделенная строка удаляется из таблицы

    Scenario: Пользователь удаляет строки(запись ребенка) с таблицы
    Given : Пустая таблица(без записей)
    When : пользователь выделил строку в таблице и  нажал кнопку "Del Child"
    Then : никаних действий не произошло, таблица отсталась пустой 

@R-16.2
Feature: Постоянна доступность(активное состояние) кнопки "Add Child"
    Как пользователь
     Я хочу чтобы кнопка "Add Child" была  доступной/активной/производившей свой прямой функционал (добавление новой записи)
    вне завимости от наполнености таблицы

    Scenario: Пользователь добавляет новые строки(запись ребенка) в таблицу
    Given : Пустая или Заполненная(с одним или несколькими добаволенными детьми) таблица
    When : пользователь нажал кнопку "Add Child"
    Then :  В конец таблицы добавляется новая запись с пустыми колонками(Имя, рост, дата рождения)


@R-17
Feature: Пользовательское меню добавления ребенка в таблицу 
    Как пользователь
    Я хочу чтобы при нажатии кнопки "Add Child", посредине окна программы появлялась форма
    со следующими полями: "Name"(@Addition2 ) ,"Height"(@Addition3 ), "Birth day"(@Addition4 ) 

    Scenario: Пользователь добавляет новые строки(запись ребенка) в таблицу
    Given : Пустая или Заполненная(с одним или несколькими добаволенными детьми) таблица
    When : пользователь нажал кнопку "Add Child"
    Then : программа открывает всплывающее окно с формой, содержащей поля:
    "Name"(@Addition2 ) ,"Height"(@Addition3 ), "Birth day"(@Addition4 ) 

@R-17.1
Feature: Запись введенных данных("Name","Height","Birth day") формы в таблицу закладки "Children"
    Как пользователь
    Я хочу чтобы после заполнения формы при нажатии соответствующей кнопки(OK) , вся введенная
    информация о ребенке , а именно поля:"Name","Height","Birth day" были перемещены в таблицу
    с соответствующими("Name","Height","Birth day")  заголовками столбоцов.
    
    Scenario: Пользователь подтверждает форму нажатием кнопки "ОК"
    Given : Заполненная форма с полями: "Name","Height","Birth day"
    When : пользователь нажимает "ОК" в окне формы
    Then : в таблицу добавляется строка с полями , указанными в форме



@R-17.2
Feature: Отмена записи введенных данных("Name","Height","Birth day") формы в таблицу закладки "Children"
    Как пользователь
    Я хочу чтобы после заполнения формы при нажатии соответствующей кнопки("Cancel") , вся введенная
    информация о ребенке , а именно форма с полями:"Name","Height","Birth day" не добавлялась в таблицу
     с соответствующими("Name","Height","Birth day")  заголовками столбоцов.
    
    Scenario: Пользователь отменяет добавление содержимого формы нажатием кнопки "Cancel"
    Given : Заполненная форма с полями: "Name","Height","Birth day"
    When : пользователь нажимает "Cancel" в окне формы
    Then : все заполненные данные в полях "Name","Height","Birth day" стрираются , 
    а операция добавления значений полей в таблицу отменяется


@R-18
Feature: Подтверждение удаления ребенка из таблицы закладки "Сhildren"
    Как один из членов семьи(Муж,Жена,Дети)
    Я хочу иметь возможность удаления ребенка из таблицы(в закладке "Children" СБД).По этому
    я хочу чтобы при нажатии кнопки удаления ребенка из таблицы("Del Children") всплывало
    модальное окно с предупреждением об удалении
    
    Scenario: Один из членов семьи(Муж,Жена,Дети) удаляет ребенка таблицы закладки "Сhildren"
    с показаным окном подтверждение удаления
    Given : Строка с заполнеными ячейками: "Name","Height","Birth day",
    вызванное модальное окно об удалении ребенка из таблицы
    When : пользователь нажимает "ОК" в окне формы подтверждения
    Then : Строка с ячейками "Name","Height","Birth day" удаляется из таблицы,
    строки таблицы, лежащие ниже удаленной строки сдвигаются вверх(на место удаленной строки)


@R-19
Feature: Отмена записи введенных данных("Name","Height","Birth day") формы в таблицу закладки "Children"
    Как пользователь
    Я хочу чтобы после заполнения формы при нажатии соответствующей кнопки("Cancel") , вся введенная
    информация о ребенке , а именно форма с полями:"Name","Height","Birth day" не добавлялась в таблицу
     с соответствующими("Name","Height","Birth day")  заголовками столбоцов.
    
    Scenario: Пользователь отменяет добавление содержимого формы нажатием кнопки "Cancel"
    Given : Заполненная форма с полями: "Name","Height","Birth day"
    When : пользователь нажимает "Cancel" в окне формы
    Then : все заполненные данные в полях "Name","Height","Birth day" стрираются , 
    а операция добавления значений полей в таблицу отменяется


@Addition2
Поле для ввода данных должны содержать:
- буквы латинской или кириллической системы письма
- максимальное колличество символов, введенных в одно поле не должно
превышать 75 единиц

@Addition3
Поле имеет 2 режима
- При ручном вводе данных поля , пользователь сам заполняет рост с приставкой "сm" в конце.
- При автоматическом вводе данных , с поля всплывает "калькулятор роста" для введения значений
через графический интерфейс калькулятора.

Поле для ввода данных должны содержать:
- буквы латинской или кириллической системы письма
- максимальное значение роста - 300 см(сантиметров)

@Addition4
Поле для ввода данных должны содержать:
- буквы латинской или кириллической системы письма
- максимальное колличество символов, введенных в одно поле не должно
превышать 75 единиц

  
     


    


    
              





 
      


    
    
            
        
    
    


      

    